In [4]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\hi\anaconda3\lib\site-packages (1.5.3)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\hi\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\hi\anaconda3\lib\site-packages (from pandas) (2022.7)
Requirement already satisfied: numpy>=1.21.0 in c:\users\hi\anaconda3\lib\site-packages (from pandas) (1.24.3)
Requirement already satisfied: six>=1.5 in c:\users\hi\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

# series

In [1]:
import numpy as np
import pandas as pd

In [2]:
labels=['a','b','c']

In [3]:
my_data=[10,12,17]

In [4]:
arr=np.array(my_data)

In [5]:
arr

array([10, 12, 17])

In [6]:
d={'a':10,'b':12,'c':17}

In [8]:
d

{'a': 10, 'b': 12, 'c': 17}

In [10]:
pd.Series(data=my_data)

0    10
1    12
2    17
dtype: int64

In [11]:
pd.Series(data=my_data,index=labels)

a    10
b    12
c    17
dtype: int64

In [12]:
pd.Series(my_data,labels)

a    10
b    12
c    17
dtype: int64

In [19]:
pd.Series(arr,labels)

a    10
b    12
c    17
dtype: int32

In [22]:
pd.Series(d)  # it take key as index and value as data

a    10
b    12
c    17
dtype: int64

In [23]:
d

{'a': 10, 'b': 12, 'c': 17}

In [13]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [25]:
pd.Series(data=[sum,len,print])

0      <built-in function sum>
1      <built-in function len>
2    <built-in function print>
dtype: object

In [14]:
ser1=pd.Series([1,2,3,4],['bd','ind','aus','pak'])

In [15]:
ser1

bd     1
ind    2
aus    3
pak    4
dtype: int64

In [16]:
ser2=pd.Series([1,2,8,7,5],['usa','ind','italy','japan','pak'])

In [17]:
ser2

usa      1
ind      2
italy    8
japan    7
pak      5
dtype: int64

In [19]:
ser1['aus']

3

In [21]:
ser2['pak']

5

In [46]:
ser3 = pd.Series(data = labels)

In [47]:
ser3

0    a
1    b
2    c
dtype: object

In [48]:
ser3[1]

'b'

In [51]:
ser1 + ser2 # index add that are match ,if don't match return NaN data

aus      NaN
bd       NaN
ind      4.0
italy    NaN
japan    NaN
pak      9.0
usa      NaN
dtype: float64

#  Data Frames

In [27]:
from numpy.random import randn

In [28]:
np.random.seed(101)

In [37]:
df=pd.DataFrame(randn(4,4),['a','b','c','d'],['w','x','y','z'])

In [38]:
df

          w         x         y         z
a -1.382920  1.482495  0.961458 -2.141212
b  0.992573  1.192241 -1.046780  1.292765
c -1.467514 -0.494095 -0.162535  0.485809
d  0.392489  0.221491 -0.855196  1.541990

In [41]:
df['z']

a   -2.141212
b    1.292765
c    0.485809
d    1.541990
Name: z, dtype: float64

In [42]:
df[['z','w']]

          z         w
a -2.141212 -1.382920
b  1.292765  0.992573
c  0.485809 -1.467514
d  1.541990  0.392489

In [43]:
df.z

a   -2.141212
b    1.292765
c    0.485809
d    1.541990
Name: z, dtype: float64

In [60]:
# creating new column 

df['new'] = df['w']+df['z']

In [47]:
df

          w         x         y         z       new
a -1.382920  1.482495  0.961458 -2.141212 -3.524132
b  0.992573  1.192241 -1.046780  1.292765  2.285338
c -1.467514 -0.494095 -0.162535  0.485809 -0.981705
d  0.392489  0.221491 -0.855196  1.541990  1.934479

In [61]:
# removing column 

df.drop('new',axis=1,inplace=True)  # axis =1 is column

In [58]:
df

          w         x         y         z
a -1.382920  1.482495  0.961458 -2.141212
b  0.992573  1.192241 -1.046780  1.292765
c -1.467514 -0.494095 -0.162535  0.485809

In [63]:
df.drop('c',axis=0,inplace=True)  # axis =0 is row

In [64]:
df

          w         x         y         z
a -1.382920  1.482495  0.961458 -2.141212
b  0.992573  1.192241 -1.046780  1.292765

In [65]:
# print row

df.loc['a']

w   -1.382920
x    1.482495
y    0.961458
z   -2.141212
Name: a, dtype: float64

In [66]:
df.loc[['a','b']]

          w         x         y         z
a -1.382920  1.482495  0.961458 -2.141212
b  0.992573  1.192241 -1.046780  1.292765

In [67]:
df.iloc[1]

w    0.992573
x    1.192241
y   -1.046780
z    1.292765
Name: b, dtype: float64

In [68]:
df.loc['b','y']

-1.0467795376984979

In [69]:
df

          w         x         y         z
a -1.382920  1.482495  0.961458 -2.141212
b  0.992573  1.192241 -1.046780  1.292765

In [72]:
df.loc[['a','b'],['x','y']]

          x         y
a  1.482495  0.961458
b  1.192241 -1.046780

# conditional selection

In [74]:
df=pd.DataFrame(randn(4,4),['a','b','c','d'],['w','x','y','z'])

In [75]:
df

          w         x         y         z
a  0.666319 -0.538235 -0.568581  1.407338
b  0.641806 -0.905100 -0.391157  1.028293
c -1.972605 -0.866885  0.720788 -1.223082
d  1.606780 -1.115710 -1.385379 -1.329660

In [76]:
df<0

       w     x      y      z
a  False  True   True  False
b  False  True   True  False
c   True  True  False   True
d  False  True   True   True

In [77]:
df>0

       w      x      y      z
a   True  False  False   True
b   True  False  False   True
c  False  False   True  False
d   True  False  False  False

In [78]:
df['x']<0

a    True
b    True
c    True
d    True
Name: x, dtype: bool

In [80]:
df['x']

a   -0.538235
b   -0.905100
c   -0.866885
d   -1.115710
Name: x, dtype: float64

In [82]:
df[df['z']<0]

          w         x         y         z
c -1.972605 -0.866885  0.720788 -1.223082
d  1.606780 -1.115710 -1.385379 -1.329660

In [85]:
restltdf=df[df['w']>0]

In [87]:
restltdf

          w         x         y         z
a  0.666319 -0.538235 -0.568581  1.407338
b  0.641806 -0.905100 -0.391157  1.028293
d  1.606780 -1.115710 -1.385379 -1.329660

In [89]:
df[df['w']>0][['y','x']]

          y         x
a -0.568581 -0.538235
b -0.391157 -0.905100
d -1.385379 -1.115710

In [96]:
df[(df['w']>0) & (df['y']<0)]

          w         x         y         z
a  0.666319 -0.538235 -0.568581  1.407338
b  0.641806 -0.905100 -0.391157  1.028293
d  1.606780 -1.115710 -1.385379 -1.329660

In [97]:
df[(df['w']>0) | (df['y']<0)]

          w         x         y         z
a  0.666319 -0.538235 -0.568581  1.407338
b  0.641806 -0.905100 -0.391157  1.028293
d  1.606780 -1.115710 -1.385379 -1.329660